export default [
  {
    path: '/QryProv.do',
    method: 'get',
    handle() {
      let list = [
        {
          text: '北京市',
          children: [
            {
              text: '北京市',
              children: [
                {
                  text: '东城区',
                  value: '110101000000',
                },
                {
                  text: '西城区',
                  value: '110102000000',
                },
                {
                  text: '朝阳区',
                  value: '110105000000',
                },
                {
                  text: '丰台区',
                  value: '110106000000',
                },
                {
                  text: '石景山区',
                  value: '110107000000',
                },
                {
                  text: '海淀区',
                  value: '110108000000',
                },
                {
                  text: '门头沟区',
                  value: '110109000000',
                },
                {
                  text: '房山区',
                  value: '110111000000',
                },
                {
                  text: '通州区',
                  value: '110112000000',
                },
                {
                  text: '顺义区',
                  value: '110113000000',
                },
                {
                  text: '昌平区',
                  value: '110114000000',
                },
                {
                  text: '大兴区',
                  value: '110115000000',
                },
                {
                  text: '怀柔区',
                  value: '110116000000',
                },
                {
                  text: '平谷区',
                  value: '110117000000',
                },
                {
                  text: '密云区',
                  value: '110118000000',
                },
                {
                  text: '延庆区',
                  value: '110119000000',
                },
              ],
            },
          ],
          value: '110000000000',
        },
        {
          text: '天津市',
          children: [
            {
              text: '天津市',
              children: [
                {
                  text: '和平区',
                  value: '120101000000',
                },
                {
                  text: '河东区',
                  value: '120102000000',
                },
                {
                  text: '河西区',
                  value: '120103000000',
                },
                {
                  text: '南开区',
                  value: '120104000000',
                },
                {
                  text: '河北区',
                  value: '120105000000',
                },
                {
                  text: '红桥区',
                  value: '120106000000',
                },
                {
                  text: '东丽区',
                  value: '120110000000',
                },
                {
                  text: '西青区',
                  value: '120111000000',
                },
                {
                  text: '津南区',
                  value: '120112000000',
                },
                {
                  text: '北辰区',
                  value: '120113000000',
                },
                {
                  text: '武清区',
                  value: '120114000000',
                },
                {
                  text: '宝坻区',
                  value: '120115000000',
                },
                {
                  text: '滨海新区',
                  value: '120116000000',
                },
                {
                  text: '宁河区',
                  value: '120117000000',
                },
                {
                  text: '静海区',
                  value: '120118000000',
                },
                {
                  text: '蓟州区',
                  value: '120119000000',
                },
              ],
            },
          ],
          value: '120000000000',
        },
        {
          text: '河北省',
          children: [
            {
              text: '石家庄市',
              children: [
                {
                  text: '市辖区',
                  value: '130101000000',
                },
                {
                  text: '长安区',
                  value: '130102000000',
                },
                {
                  text: '桥西区',
                  value: '130104000000',
                },
                {
                  text: '新华区',
                  value: '130105000000',
                },
                {
                  text: '井陉矿区',
                  value: '130107000000',
                },
                {
                  text: '裕华区',
                  value: '130108000000',
                },
                {
                  text: '藁城区',
                  value: '130109000000',
                },
                {
                  text: '鹿泉区',
                  value: '130110000000',
                },
                {
                  text: '栾城区',
                  value: '130111000000',
                },
                {
                  text: '井陉县',
                  value: '130121000000',
                },
                {
                  text: '正定县',
                  value: '130123000000',
                },
                {
                  text: '行唐县',
                  value: '130125000000',
                },
                {
                  text: '灵寿县',
                  value: '130126000000',
                },
                {
                  text: '高邑县',
                  value: '130127000000',
                },
                {
                  text: '深泽县',
                  value: '130128000000',
                },
                {
                  text: '赞皇县',
                  value: '130129000000',
                },
                {
                  text: '无极县',
                  value: '130130000000',
                },
                {
                  text: '平山县',
                  value: '130131000000',
                },
                {
                  text: '元氏县',
                  value: '130132000000',
                },
                {
                  text: '赵县',
                  value: '130133000000',
                },
                {
                  text: '石家庄高新技术产业开发区',
                  value: '130171000000',
                },
                {
                  text: '石家庄循环化工园区',
                  value: '130172000000',
                },
                {
                  text: '辛集市',
                  value: '130181000000',
                },
                {
                  text: '晋州市',
                  value: '130183000000',
                },
                {
                  text: '新乐市',
                  value: '130184000000',
                },
              ],
              value: '130100000000',
            },
            {
              text: '唐山市',
              children: [
                {
                  text: '市辖区',
                  value: '130201000000',
                },
                {
                  text: '路南区',
                  value: '130202000000',
                },
                {
                  text: '路北区',
                  value: '130203000000',
                },
                {
                  text: '古冶区',
                  value: '130204000000',
                },
                {
                  text: '开平区',
                  value: '130205000000',
                },
                {
                  text: '丰南区',
                  value: '130207000000',
                },
                {
                  text: '丰润区',
                  value: '130208000000',
                },
                {
                  text: '曹妃甸区',
                  value: '130209000000',
                },
                {
                  text: '滦南县',
                  value: '130224000000',
                },
                {
                  text: '乐亭县',
                  value: '130225000000',
                },
                {
                  text: '迁西县',
                  value: '130227000000',
                },
                {
                  text: '玉田县',
                  value: '130229000000',
                },
                {
                  text: '唐山市芦台经济技术开发区',
                  value: '130271000000',
                },
                {
                  text: '唐山市汉沽管理区',
                  value: '130272000000',
                },
                {
                  text: '唐山高新技术产业开发区',
                  value: '130273000000',
                },
                {
                  text: '河北唐山海港经济开发区',
                  value: '130274000000',
                },
                {
                  text: '遵化市',
                  value: '130281000000',
                },
                {
                  text: '迁安市',
                  value: '130283000000',
                },
                {
                  text: '滦州市',
                  value: '130284000000',
                },
              ],
              value: '130200000000',
            },
            {
              text: '秦皇岛市',
              children: [
                {
                  text: '市辖区',
                  value: '130301000000',
                },
                {
                  text: '海港区',
                  value: '130302000000',
                },
                {
                  text: '山海关区',
                  value: '130303000000',
                },
                {
                  text: '北戴河区',
                  value: '130304000000',
                },
                {
                  text: '抚宁区',
                  value: '130306000000',
                },
                {
                  text: '青龙满族自治县',
                  value: '130321000000',
                },
                {
                  text: '昌黎县',
                  value: '130322000000',
                },
                {
                  text: '卢龙县',
                  value: '130324000000',
                },
                {
                  text: '秦皇岛市经济技术开发区',
                  value: '130371000000',
                },
                {
                  text: '北戴河新区',
                  value: '130372000000',
                },
              ],
              value: '130300000000',
            },
            {
              text: '邯郸市',
              children: [
                {
                  text: '市辖区',
                  value: '130401000000',
                },
                {
                  text: '邯山区',
                  value: '130402000000',
                },
                {
                  text: '丛台区',
                  value: '130403000000',
                },
                {
                  text: '复兴区',
                  value: '130404000000',
                },
                {
                  text: '峰峰矿区',
                  value: '130406000000',
                },
                {
                  text: '肥乡区',
                  value: '130407000000',
                },
                {
                  text: '永年区',
                  value: '130408000000',
                },
                {
                  text: '临漳县',
                  value: '130423000000',
                },
                {
                  text: '成安县',
                  value: '130424000000',
                },
                {
                  text: '大名县',
                  value: '130425000000',
                },
                {
                  text: '涉县',
                  value: '130426000000',
                },
                {
                  text: '磁县',
                  value: '130427000000',
                },
                {
                  text: '邱县',
                  value: '130430000000',
                },
                {
                  text: '鸡泽县',
                  value: '130431000000',
                },
                {
                  text: '广平县',
                  value: '130432000000',
                },
                {
                  text: '馆陶县',
                  value: '130433000000',
                },
                {
                  text: '魏县',
                  value: '130434000000',
                },
                {
                  text: '曲周县',
                  value: '130435000000',
                },
                {
                  text: '邯郸经济技术开发区',
                  value: '130471000000',
                },
                {
                  text: '邯郸冀南新区',
                  value: '130473000000',
                },
                {
                  text: '武安市',
                  value: '130481000000',
                },
              ],
              value: '130400000000',
            },
            {
              text: '邢台市',
              children: [
                {
                  text: '市辖区',
                  value: '130501000000',
                },
                {
                  text: '桥东区',
                  value: '130502000000',
                },
                {
                  text: '桥西区',
                  value: '130503000000',
                },
                {
                  text: '邢台县',
                  value: '130521000000',
                },
                {
                  text: '临城县',
                  value: '130522000000',
                },
                {
                  text: '内丘县',
                  value: '130523000000',
                },
                {
                  text: '柏乡县',
                  value: '130524000000',
                },
                {
                  text: '隆尧县',
                  value: '130525000000',
                },
                {
                  text: '任县',
                  value: '130526000000',
                },
                {
                  text: '南和县',
                  value: '130527000000',
                },
                {
                  text: '宁晋县',
                  value: '130528000000',
                },
                {
                  text: '巨鹿县',
                  value: '130529000000',
                },
                {
                  text: '新河县',
                  value: '130530000000',
                },
                {
                  text: '广宗县',
                  value: '130531000000',
                },
                {
                  text: '平乡县',
                  value: '130532000000',
                },
                {
                  text: '威县',
                  value: '130533000000',
                },
                {
                  text: '清河县',
                  value: '130534000000',
                },
                {
                  text: '临西县',
                  value: '130535000000',
                },
                {
                  text: '河北邢台经济开发区',
                  value: '130571000000',
                },
                {
                  text: '南宫市',
                  value: '130581000000',
                },
                {
                  text: '沙河市',
                  value: '130582000000',
                },
              ],
              value: '130500000000',
            },
            {
              text: '保定市',
              children: [
                {
                  text: '市辖区',
                  value: '130601000000',
                },
                {
                  text: '竞秀区',
                  value: '130602000000',
                },
                {
                  text: '莲池区',
                  value: '130606000000',
                },
                {
                  text: '满城区',
                  value: '130607000000',
                },
                {
                  text: '清苑区',
                  value: '130608000000',
                },
                {
                  text: '徐水区',
                  value: '130609000000',
                },
                {
                  text: '涞水县',
                  value: '130623000000',
                },
                {
                  text: '阜平县',
                  value: '130624000000',
                },
                {
                  text: '定兴县',
                  value: '130626000000',
                },
                {
                  text: '唐县',
                  value: '130627000000',
                },
                {
                  text: '高阳县',
                  value: '130628000000',
                },
                {
                  text: '容城县',
                  value: '130629000000',
                },
                {
                  text: '涞源县',
                  value: '130630000000',
                },
                {
                  text: '望都县',
                  value: '130631000000',
                },
                {
                  text: '安新县',
                  value: '130632000000',
                },
                {
                  text: '易县',
                  value: '130633000000',
                },
                {
                  text: '曲阳县',
                  value: '130634000000',
                },
                {
                  text: '蠡县',
                  value: '130635000000',
                },
                {
                  text: '顺平县',
                  value: '130636000000',
                },
                {
                  text: '博野县',
                  value: '130637000000',
                },
                {
                  text: '雄县',
                  value: '130638000000',
                },
                {
                  text: '保定高新技术产业开发区',
                  value: '130671000000',
                },
                {
                  text: '保定白沟新城',
                  value: '130672000000',
                },
                {
                  text: '涿州市',
                  value: '130681000000',
                },
                {
                  text: '定州市',
                  value: '130682000000',
                },
                {
                  text: '安国市',
                  value: '130683000000',
                },
                {
                  text: '高碑店市',
                  value: '130684000000',
                },
              ],
              value: '130600000000',
            },
            {
              text: '张家口市',
              children: [
                {
                  text: '市辖区',
                  value: '130701000000',
                },
                {
                  text: '桥东区',
                  value: '130702000000',
                },
                {
                  text: '桥西区',
                  value: '130703000000',
                },
                {
                  text: '宣化区',
                  value: '130705000000',
                },
                {
                  text: '下花园区',
                  value: '130706000000',
                },
                {
                  text: '万全区',
                  value: '130708000000',
                },
                {
                  text: '崇礼区',
                  value: '130709000000',
                },
                {
                  text: '张北县',
                  value: '130722000000',
                },
                {
                  text: '康保县',
                  value: '130723000000',
                },
                {
                  text: '沽源县',
                  value: '130724000000',
                },
                {
                  text: '尚义县',
                  value: '130725000000',
                },
                {
                  text: '蔚县',
                  value: '130726000000',
                },
                {
                  text: '阳原县',
                  value: '130727000000',
                },
                {
                  text: '怀安县',
                  value: '130728000000',
                },
                {
                  text: '怀来县',
                  value: '130730000000',
                },
                {
                  text: '涿鹿县',
                  value: '130731000000',
                },
                {
                  text: '赤城县',
                  value: '130732000000',
                },
                {
                  text: '张家口市高新技术产业开发区',
                  value: '130771000000',
                },
                {
                  text: '张家口市察北管理区',
                  value: '130772000000',
                },
                {
                  text: '张家口市塞北管理区',
                  value: '130773000000',
                },
              ],
              value: '130700000000',
            },
            {
              text: '承德市',
              children: [
                {
                  text: '市辖区',
                  value: '130801000000',
                },
                {
                  text: '双桥区',
                  value: '130802000000',
                },
                {
                  text: '双滦区',
                  value: '130803000000',
                },
                {
                  text: '鹰手营子矿区',
                  value: '130804000000',
                },
                {
                  text: '承德县',
                  value: '130821000000',
                },
                {
                  text: '兴隆县',
                  value: '130822000000',
                },
                {
                  text: '滦平县',
                  value: '130824000000',
                },
                {
                  text: '隆化县',
                  value: '130825000000',
                },
                {
                  text: '丰宁满族自治县',
                  value: '130826000000',
                },
                {
                  text: '宽城满族自治县',
                  value: '130827000000',
                },
                {
                  text: '围场满族蒙古族自治县',
                  value: '130828000000',
                },
                {
                  text: '承德高新技术产业开发区',
                  value: '130871000000',
                },
                {
                  text: '平泉市',
                  value: '130881000000',
                },
              ],
              value: '130800000000',
            },
            {
              text: '沧州市',
              children: [
                {
                  text: '市辖区',
                  value: '130901000000',
                },
                {
                  text: '新华区',
                  value: '130902000000',
                },
                {
                  text: '运河区',
                  value: '130903000000',
                },
                {
                  text: '沧县',
                  value: '130921000000',
                },
                {
                  text: '青县',
                  value: '130922000000',
                },
                {
                  text: '东光县',
                  value: '130923000000',
                },
                {
                  text: '海兴县',
                  value: '130924000000',
                },
                {
                  text: '盐山县',
                  value: '130925000000',
                },
                {
                  text: '肃宁县',
                  value: '130926000000',
                },
                {
                  text: '南皮县',
                  value: '130927000000',
                },
                {
                  text: '吴桥县',
                  value: '130928000000',
                },
                {
                  text: '献县',
                  value: '130929000000',
                },
                {
                  text: '孟村回族自治县',
                  value: '130930000000',
                },
                {
                  text: '河北沧州经济开发区',
                  value: '130971000000',
                },
                {
                  text: '沧州高新技术产业开发区',
                  value: '130972000000',
                },
                {
                  text: '沧州渤海新区',
                  value: '130973000000',
                },
                {
                  text: '泊头市',
                  value: '130981000000',
                },
                {
                  text: '任丘市',
                  value: '130982000000',
                },
                {
                  text: '黄骅市',
                  value: '130983000000',
                },
                {
                  text: '河间市',
                  value: '130984000000',
                },
              ],
              value: '130900000000',
            },
            {
              text: '廊坊市',
              children: [
                {
                  text: '市辖区',
                  value: '131001000000',
                },
                {
                  text: '安次区',
                  value: '131002000000',
                },
                {
                  text: '广阳区',
                  value: '131003000000',
                },
                {
                  text: '固安县',
                  value: '131022000000',
                },
                {
                  text: '永清县',
                  value: '131023000000',
                },
                {
                  text: '香河县',
                  value: '131024000000',
                },
                {
                  text: '大城县',
                  value: '131025000000',
                },
                {
                  text: '文安县',
                  value: '131026000000',
                },
                {
                  text: '大厂回族自治县',
                  value: '131028000000',
                },
                {
                  text: '廊坊经济技术开发区',
                  value: '131071000000',
                },
                {
                  text: '霸州市',
                  value: '131081000000',
                },
                {
                  text: '三河市',
                  value: '131082000000',
                },
              ],
              value: '131000000000',
            },
            {
              text: '衡水市',
              children: [
                {
                  text: '市辖区',
                  value: '131101000000',
                },
                {
                  text: '桃城区',
                  value: '131102000000',
                },
                {
                  text: '冀州区',
                  value: '131103000000',
                },
                {
                  text: '枣强县',
                  value: '131121000000',
                },
                {
                  text: '武邑县',
                  value: '131122000000',
                },
                {
                  text: '武强县',
                  value: '131123000000',
                },
                {
                  text: '饶阳县',
                  value: '131124000000',
                },
                {
                  text: '安平县',
                  value: '131125000000',
                },
                {
                  text: '故城县',
                  value: '131126000000',
                },
                {
                  text: '景县',
                  value: '131127000000',
                },
                {
                  text: '阜城县',
                  value: '131128000000',
                },
                {
                  text: '河北衡水高新技术产业开发区',
                  value: '131171000000',
                },
                {
                  text: '衡水滨湖新区',
                  value: '131172000000',
                },
                {
                  text: '深州市',
                  value: '131182000000',
                },
              ],
              value: '131100000000',
            },
          ],
          value: '130000000000',
        },
      ];
      return {
        _RejCode: '000000',
        state: 'SUCCESS',
        msg: '查询成功',
        data: list,
      };
    },
  },
];
