/**
 * @file 校验 正则
 */
const regex = {
  // 邮箱校验
  emileRxg: /^(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/,
  // 二代身份证校验 最后一位可以是数字或Xx
  IDcardRxg: /^[1-9]\d{5}(?:18|19|20)\d{2}(?:0[1-9]|10|11|12)(?:0[1-9]|[1-2]\d|30|31)\d{3}[\dXx]$/,
  // 手机号 严谨校验
  phoneRxg: /^(?:(?:\+|00)86)?1(?:(?:3[\d])|(?:4[5-79])|(?:5[0-35-9])|(?:6[5-7])|(?:7[0-8])|(?:8[\d])|(?:9[189]))\d{8}$/,
  // 手机号 宽松
  phoneLooseRxg: /^(?:(?:\+|00)86)?1[3-9]\d{9}$/,
  // 座机电话
  tel: /^(?:(?:\d{3}-)?\d{8}|^(?:\d{4}-)?\d{7,8})(?:-\d+)?$/,
  // 六位数字短信验证码
  textCaptcha: /^[0-9]{6}$/,
  // 判断是否 url
  urlRxg: /^(((ht|f)tps?):\/\/)?[\w-]+(\.[\w-]+)+([\w.,@?^=%&:/~+#-\\(\\)]*[\w@?^=%&/~+#-\\(\\)])?$/,
  // 银行卡号(10-30位)
  bankCardRxg: /^([1-9]{1})(\d{15}|\d{18})$/,
  // 大小写字母、数字、中文
  inputRxg: /^[A-Za-z0-9\u4e00-\u9fa5]+$/,
  // 车牌号校验，含新能源
  plateNumber: /^([京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[A-Z]{1}(([0-9]{5}[DF])|([DF]([A-HJ-NP-Z0-9])[0-9]{4})))|([京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[A-Z]{1}[A-HJ-NP-Z0-9]{4}[A-HJ-NP-Z0-9挂学警港澳]{1})$/,
};

export { regex };
